; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v6 ?v3)
             (pred_6 ?v4 ?v11)
             (pred_1 ?v6 ?v11)
             (pred_4 ?v8 ?v6 )
	     (pred_2 ?v6)
             (pred_5 ?v1)
             (pred_11 ?v4)
             (pred_10 ?v11)
             (pred_7 ?v6)
             (pred_9 ?v4)
             (pred_3 ?v6)
             (pred_12 ))



(:action op_4
:parameters (?v9 ?v7 ?v10 ?v12)
:precondition (and (pred_5 ?v9) (pred_5 ?v7) (pred_11 ?v10) (pred_10 ?v12)
          (pred_8 ?v9 ?v7) (pred_6 ?v10 ?v12)
                   (pred_1 ?v7 ?v12) (pred_2 ?v9) 
                   (pred_7 ?v7) (pred_9 ?v10))
:effect (and  (pred_3 ?v7) (not (pred_7 ?v7))))


(:action op_2
:parameters (?v9 ?v5)
:precondition (and (pred_5 ?v9) (pred_5 ?v5)
               (pred_2 ?v9) (pred_8 ?v9 ?v5) (pred_3 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v9))))

(:action op_5
:parameters (?v9 ?v10)
:precondition (and (pred_5 ?v9) (pred_11 ?v10) 
                  (pred_2 ?v9) (pred_4 ?v10 ?v9) (pred_12 ))
:effect (and (pred_9 ?v10)
   (not (pred_4 ?v10 ?v9)) (not (pred_12 ))))


(:action op_1
:parameters (?v9 ?v2 ?v13)
:precondition (and (pred_5 ?v9) (pred_11 ?v2) (pred_11 ?v13)
                  (pred_2 ?v9) (pred_9 ?v13) (pred_4 ?v2 ?v9))
:effect (and (pred_9 ?v2) (pred_4 ?v13 ?v9)
        (not (pred_9 ?v13)) (not (pred_4 ?v2 ?v9))))

(:action op_3
:parameters (?v9 ?v10)
:precondition (and (pred_5 ?v9) (pred_11 ?v10) 
                  (pred_2 ?v9) (pred_9 ?v10))
:effect (and (pred_12 ) (pred_4 ?v10 ?v9) (not (pred_9 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_09 obj_10 obj_16 obj_30 obj_26 obj_23 obj_31 obj_24 obj_07 obj_27 obj_18 obj_20 obj_02 obj_04 obj_05 obj_13 obj_06 obj_22 obj_19 obj_17 obj_29 obj_14 obj_28 obj_11
    obj_03 obj_08 obj_25
    obj_21 obj_15 obj_12
    )

    (:init
       (pred_12)

       (pred_5 obj_01)
       (pred_5 obj_09)
       (pred_5 obj_10)
       (pred_5 obj_16)
       (pred_5 obj_30)
       (pred_5 obj_26)
       (pred_5 obj_23)
       (pred_5 obj_31)
       (pred_5 obj_24)
       (pred_5 obj_07)
       (pred_5 obj_27)
       (pred_5 obj_18)
       (pred_5 obj_20)
       (pred_5 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_05)
       (pred_5 obj_13)
       (pred_5 obj_06)
       (pred_5 obj_22)
       (pred_5 obj_19)
       (pred_5 obj_17)
       (pred_5 obj_29)
       (pred_5 obj_14)
       (pred_5 obj_28)
       (pred_5 obj_11)
       (pred_10 obj_03)
       (pred_10 obj_08)
       (pred_10 obj_25)
       (pred_11 obj_21)
       (pred_11 obj_15)
       (pred_11 obj_12)

       (pred_8 obj_01 obj_26)
       (pred_8 obj_01 obj_09)
       (pred_8 obj_09 obj_23)
       (pred_8 obj_09 obj_10)
       (pred_8 obj_09 obj_01)
       (pred_8 obj_10 obj_31)
       (pred_8 obj_10 obj_16)
       (pred_8 obj_10 obj_09)
       (pred_8 obj_16 obj_24)
       (pred_8 obj_16 obj_30)
       (pred_8 obj_16 obj_10)
       (pred_8 obj_30 obj_07)
       (pred_8 obj_30 obj_16)
       (pred_8 obj_26 obj_27)
       (pred_8 obj_26 obj_23)
       (pred_8 obj_26 obj_01)
       (pred_8 obj_23 obj_18)
       (pred_8 obj_23 obj_31)
       (pred_8 obj_23 obj_09)
       (pred_8 obj_23 obj_26)
       (pred_8 obj_31 obj_20)
       (pred_8 obj_31 obj_24)
       (pred_8 obj_31 obj_10)
       (pred_8 obj_31 obj_23)
       (pred_8 obj_24 obj_02)
       (pred_8 obj_24 obj_07)
       (pred_8 obj_24 obj_16)
       (pred_8 obj_24 obj_31)
       (pred_8 obj_07 obj_04)
       (pred_8 obj_07 obj_30)
       (pred_8 obj_07 obj_24)
       (pred_8 obj_27 obj_05)
       (pred_8 obj_27 obj_18)
       (pred_8 obj_27 obj_26)
       (pred_8 obj_18 obj_13)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_18 obj_23)
       (pred_8 obj_18 obj_27)
       (pred_8 obj_20 obj_06)
       (pred_8 obj_20 obj_02)
       (pred_8 obj_20 obj_31)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_02 obj_22)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_02 obj_24)
       (pred_8 obj_02 obj_20)
       (pred_8 obj_04 obj_19)
       (pred_8 obj_04 obj_07)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_05 obj_17)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_05 obj_27)
       (pred_8 obj_13 obj_29)
       (pred_8 obj_13 obj_06)
       (pred_8 obj_13 obj_18)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_06 obj_14)
       (pred_8 obj_06 obj_22)
       (pred_8 obj_06 obj_20)
       (pred_8 obj_06 obj_13)
       (pred_8 obj_22 obj_28)
       (pred_8 obj_22 obj_19)
       (pred_8 obj_22 obj_02)
       (pred_8 obj_22 obj_06)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_19 obj_04)
       (pred_8 obj_19 obj_22)
       (pred_8 obj_17 obj_29)
       (pred_8 obj_17 obj_05)
       (pred_8 obj_29 obj_14)
       (pred_8 obj_29 obj_13)
       (pred_8 obj_29 obj_17)
       (pred_8 obj_14 obj_28)
       (pred_8 obj_14 obj_06)
       (pred_8 obj_14 obj_29)
       (pred_8 obj_28 obj_11)
       (pred_8 obj_28 obj_22)
       (pred_8 obj_28 obj_14)
       (pred_8 obj_11 obj_19)
       (pred_8 obj_11 obj_28)
       (pred_7 obj_06)
       (pred_7 obj_29)
       (pred_7 obj_22)
       (pred_1  obj_06 obj_03)
       (pred_1  obj_29 obj_08)
       (pred_1  obj_22 obj_25)
       (pred_3 obj_01)
       (pred_3 obj_09)
       (pred_3 obj_10)
       (pred_3 obj_16)
       (pred_3 obj_30)
       (pred_3 obj_26)
       (pred_3 obj_23)
       (pred_3 obj_31)
       (pred_3 obj_24)
       (pred_3 obj_07)
       (pred_3 obj_27)
       (pred_3 obj_18)
       (pred_3 obj_20)
       (pred_3 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_05)
       (pred_3 obj_13)
       (pred_3 obj_19)
       (pred_3 obj_17)
       (pred_3 obj_14)
       (pred_3 obj_28)
       (pred_3 obj_11)

       (pred_6  obj_21 obj_03)
       (pred_6  obj_15 obj_08)
       (pred_6  obj_12 obj_25)
       (pred_4 obj_21 obj_02)
       (pred_4 obj_15 obj_11)
       (pred_4 obj_12 obj_28)
       (pred_2 obj_10)
    )

    (:goal (and
       (pred_4 obj_21 obj_23)
       (pred_4 obj_15 obj_05)
    ))
(:constraints
  (always (not (pred_2 obj_24)))
)
)

; plan
1. (op_2 obj_10 obj_31)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_31)
   goals met: 0 of 2
2. (op_2 obj_31 obj_20)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_20)
   goals met: 0 of 2
3. (op_2 obj_20 obj_02)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_02)
   goals met: 0 of 2
4. (op_5 obj_02 obj_21)
   deleted: (pred_4 obj_21 obj_02) (pred_12)
   added: (pred_9 obj_21)
   goals met: 0 of 2
5. (op_2 obj_02 obj_20)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_20)
   goals met: 0 of 2
6. (op_2 obj_20 obj_18)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_18)
   goals met: 0 of 2
7. (op_2 obj_18 obj_23)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_23)
   goals met: 0 of 2
8. (op_3 obj_23 obj_21)
   deleted: (pred_9 obj_21)
   added: (pred_12) (pred_4 obj_21 obj_23)
   goals met: 1 of 2
9. (op_2 obj_23 obj_18)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_18)
   goals met: 1 of 2
10. (op_2 obj_18 obj_20)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_20)
   goals met: 1 of 2
11. (op_2 obj_20 obj_02)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_02)
   goals met: 1 of 2
12. (op_2 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 1 of 2
13. (op_2 obj_04 obj_19)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_19)
   goals met: 1 of 2
14. (op_2 obj_19 obj_11)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_11)
   goals met: 1 of 2
15. (op_5 obj_11 obj_15)
   deleted: (pred_4 obj_15 obj_11) (pred_12)
   added: (pred_9 obj_15)
   goals met: 1 of 2
16. (op_2 obj_11 obj_28)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_28)
   goals met: 1 of 2
17. (op_2 obj_28 obj_14)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_14)
   goals met: 1 of 2
18. (op_4 obj_14 obj_29 obj_15 obj_08)
   deleted: (pred_7 obj_29)
   added: (pred_3 obj_29)
   goals met: 1 of 2
19. (op_2 obj_14 obj_29)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_29)
   goals met: 1 of 2
20. (op_2 obj_29 obj_13)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_13)
   goals met: 1 of 2
21. (op_2 obj_13 obj_05)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_05)
   goals met: 1 of 2
22. (op_3 obj_05 obj_15)
   deleted: (pred_9 obj_15)
   added: (pred_12) (pred_4 obj_15 obj_05)
   goals met: 2 of 2
